/**
 * Created by truemenhale on 16/5/17.
 */
var _data = [
    {
        "question":"他是小岗村党支部第一书记。任职满后，村民强烈要求把他留下来，98颗手印，感动了组织，也感动了他自己。他是____？",
        "answer":"沈浩",
        "analyse":"沈 浩（1964—2009），男，汉族，安徽萧县圣泉乡人。1986年7月，加入中国共产党。2004年，作为选派农村任职干部到凤阳县任小岗村党支部第一书记、村委会主任。沈浩为党的事业，为“三农”做出了重大贡献。先后获得全国百名优秀村官、感动中国2009年度人物、全国敬业奉献模范等荣誉。感动中国人物评选组委会颁奖辞：两任村官，六载离家，总是和农民面对面，肩并肩。他走得匆忙，放不下村里道路工厂和农田，对不住家中娇妻幼女与高堂。那一年，村民按下红手印，改变乡村的命运；如今，他们再次伸出手指，鲜红手印，颗颗都是他的碑文。",
        "pic":"images/sh.jpg",
        "nameLength":2
    },
    {
        "question":"他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。他是____？",
        "answer":"马本斋",
        "analyse":"马本斋（1902—1944）男，回族，河北省献县人，中共党员。马本斋早年投身奉军当兵，逐级升至团长。“九一八事变”后，因不满国民党蒋介石的不抵抗政策，毅然弃官返乡。从1937年至1944年，他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。1944年1月底，部队奉命开赴延安。出发前，他抱病为部队作了最后一次动员，叮嘱指战员“要跟着党，跟着毛主席，抗战到底！”同年2月7日，在山东莘县不幸病逝。",
        "pic":"images/mbz.jpg",
        "nameLength":3
    },
    {
        "question":"他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。他是____？",
        "answer":"马本斋",
        "analyse":"马本斋（1902—1944）男，回族，河北省献县人，中共党员。马本斋早年投身奉军当兵，逐级升至团长。“九一八事变”后，因不满国民党蒋介石的不抵抗政策，毅然弃官返乡。从1937年至1944年，他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。1944年1月底，部队奉命开赴延安。出发前，他抱病为部队作了最后一次动员，叮嘱指战员“要跟着党，跟着毛主席，抗战到底！”同年2月7日，在山东莘县不幸病逝。",
        "pic":"images/mbz.jpg",
        "nameLength":3
    },
    {
        "question":"他是小岗村党支部第一书记。任职满后，村民强烈要求把他留下来，98颗手印，感动了组织，也感动了他自己。他是____？",
        "answer":"沈浩",
        "analyse":"沈 浩（1964—2009），男，汉族，安徽萧县圣泉乡人。1986年7月，加入中国共产党。2004年，作为选派农村任职干部到凤阳县任小岗村党支部第一书记、村委会主任。沈浩为党的事业，为“三农”做出了重大贡献。先后获得全国百名优秀村官、感动中国2009年度人物、全国敬业奉献模范等荣誉。感动中国人物评选组委会颁奖辞：两任村官，六载离家，总是和农民面对面，肩并肩。他走得匆忙，放不下村里道路工厂和农田，对不住家中娇妻幼女与高堂。那一年，村民按下红手印，改变乡村的命运；如今，他们再次伸出手指，鲜红手印，颗颗都是他的碑文。",
        "pic":"images/sh.jpg",
        "nameLength":2
    },
    {
        "question":"他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。他是____？",
        "answer":"马本斋",
        "analyse":"马本斋（1902—1944）男，回族，河北省献县人，中共党员。马本斋早年投身奉军当兵，逐级升至团长。“九一八事变”后，因不满国民党蒋介石的不抵抗政策，毅然弃官返乡。从1937年至1944年，他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。1944年1月底，部队奉命开赴延安。出发前，他抱病为部队作了最后一次动员，叮嘱指战员“要跟着党，跟着毛主席，抗战到底！”同年2月7日，在山东莘县不幸病逝。",
        "pic":"images/mbz.jpg",
        "nameLength":3
    },
    {
        "question":"他是小岗村党支部第一书记。任职满后，村民强烈要求把他留下来，98颗手印，感动了组织，也感动了他自己。他是____？",
        "answer":"沈浩",
        "analyse":"沈 浩（1964—2009），男，汉族，安徽萧县圣泉乡人。1986年7月，加入中国共产党。2004年，作为选派农村任职干部到凤阳县任小岗村党支部第一书记、村委会主任。沈浩为党的事业，为“三农”做出了重大贡献。先后获得全国百名优秀村官、感动中国2009年度人物、全国敬业奉献模范等荣誉。感动中国人物评选组委会颁奖辞：两任村官，六载离家，总是和农民面对面，肩并肩。他走得匆忙，放不下村里道路工厂和农田，对不住家中娇妻幼女与高堂。那一年，村民按下红手印，改变乡村的命运；如今，他们再次伸出手指，鲜红手印，颗颗都是他的碑文。",
        "pic":"images/sh.jpg",
        "nameLength":2
    },
    {
        "question":"他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。他是____？",
        "answer":"马本斋",
        "analyse":"马本斋（1902—1944）男，回族，河北省献县人，中共党员。马本斋早年投身奉军当兵，逐级升至团长。“九一八事变”后，因不满国民党蒋介石的不抵抗政策，毅然弃官返乡。从1937年至1944年，他率回民支队奋勇杀敌，经历大小战斗870余次，歼灭日伪军3.6万余人，屡建战功。1944年1月底，部队奉命开赴延安。出发前，他抱病为部队作了最后一次动员，叮嘱指战员“要跟着党，跟着毛主席，抗战到底！”同年2月7日，在山东莘县不幸病逝。",
        "pic":"images/mbz.jpg",
        "nameLength":3
    },
    {
        "question":"他是小岗村党支部第一书记。任职满后，村民强烈要求把他留下来，98颗手印，感动了组织，也感动了他自己。他是____？",
        "answer":"沈浩",
        "analyse":"沈 浩（1964—2009），男，汉族，安徽萧县圣泉乡人。1986年7月，加入中国共产党。2004年，作为选派农村任职干部到凤阳县任小岗村党支部第一书记、村委会主任。沈浩为党的事业，为“三农”做出了重大贡献。先后获得全国百名优秀村官、感动中国2009年度人物、全国敬业奉献模范等荣誉。感动中国人物评选组委会颁奖辞：两任村官，六载离家，总是和农民面对面，肩并肩。他走得匆忙，放不下村里道路工厂和农田，对不住家中娇妻幼女与高堂。那一年，村民按下红手印，改变乡村的命运；如今，他们再次伸出手指，鲜红手印，颗颗都是他的碑文。",
        "pic":"images/sh.jpg",
        "nameLength":2
    }
];
var confusion = "丁万世丘临丹丽乔书仁仇任伟何余佳俞倩倪允元先光克全兰冉冯冷凤刘剑勇千华博卢卫史君吴周唐嘉国圆坚墨天奂奋奕如妍姚姜娜娟婧婷子孙宁宇安宋宏官宵寅小少尹屈屏山峥峰崔巧常广廖张彩彬彭徐微志思怡恒意慧折护振敏文新方昆明映春晏晓晨景晶曦曹曾朝朱李杜杨林柳树梅梓楠槐欣武毅毛江汤汪洪浙海涛涵淑清源潘灼炜燕玉王玲珊琪琳琴瑞瑾璞璨甜生盼睿石秀秉科秦立竹素红罗美群羽翼肖胡腾臻舒艳芬芳若英范茵茹荣荷莉莎莹菊萍蓉蓓蔡薛藜虹行衣计许诗谢谭贵贺赵超轲辅辰迎逸邓邝郑郭鑫钰钱铮银锋锦阎阮阳陈雅雪雯霖霞青靖静顺风马高魏鸾鸿麒黄黎龙";
confusion = confusion.split("");
confusion.sort(function(){ return 0.5 - Math.random() });
confusion.sort(function(){ return 0.5 - Math.random() });
confusion.sort(function(){ return 0.5 - Math.random() });
function ChangeQuestion(_data,aLi){
    var arr = (_data.confusion+_data.answer).split("");
    var Qavatar = $('.quesAvatar');
    var question = $('.question');
    question.html(_data.question);
    Qavatar.attr('src',_data.pic);
    arr.sort(function(){ return 0.5 - Math.random() });
    arr.sort(function(){ return 0.5 - Math.random() });
    arr.sort(function(){ return 0.5 - Math.random() });
    arr.sort(function(){ return 0.5 - Math.random() });
    for(var i = 0,len = aLi.length; i<len; i++){
        aLi.eq(i).html(arr[i]);
    }
    if(_data.nameLength == 3){
        $('.answer3').css('display','block');
        $('.answer2').css('display','none');
    }else {
        $('.answer2').css('display','block');
        $('.answer3').css('display','none');
    }
    $.mobile.changePage('#GamePage',{
        transition : 'flow'
    });
    $(document).on("pageshow","#GamePage",function(){
        var Iavatar = $('.introAvatar');
        var intro = $('.introWords');
        Iavatar.attr('src',_data.pic);
        intro.html(_data.analyse);
        timerMAX = setInterval(function () {
            max++;
        },1000);
        timerMid = setInterval(function () {
            if(mid == 10){
                mid = 1;
            }else {
                mid++;
            }
        },100);
        timerMin = setInterval(function () {
            if(min == 10){
                min = 1;
            }else {
                min++;
            }
        },10);
        $(document).off('pageshow');
    });
}